/*----------------------------------------------------------------------------------------
*
* YAViewer ショートカット関係
*
*----------------------------------------------------------------------------------------*/
#pragma once

#include <Windows.h>
#include <AAFileAccessor.h>


//------------------------------------------------------------------------------
//
//	関数原型宣言
//
//------------------------------------------------------------------------------
//----------------------------------------------
// ウィンドウクラス登録
//
bool RegisterYAVShortcutClass( HINSTANCE hInstance );

//----------------------------------------------
// ショートカットウィンドウ生成
//
HWND CreateShortcutWindow( HINSTANCE hInstance, HWND hParent, DWORD addStyle );

//----------------------------------------------
// メッセージの送信先
//
void SetShortcutSendNotifyWindow( HWND hShortcut, HWND hTarget );

//----------------------------------------------
// ショートカット生成
//
void SetShortcutFile( HWND hShortcut, aafile::AAFile* file );
